{
    "root": {
        "type": "list",
        "name": "root",
        "message": "You start running into the forest, not looking back. You run until your legs give in. Darkness has swallowed your surroundings. You fall asleep. Waking up, you are unsure of where you are exactly. You look around and see you are laying on a lonely gravel road.",
        "choices": [
            "Get up and look around"
        ],
        "checkpoint": 0,
        "responses": [
            {
                "chapter": "same",
                "hook": "intro1"
            }
        ]
    },
    "intro1": {
        "type": "list",
        "name": "intro1",
        "message": "The gravel road leads to a village, its tall houses dark as tombstones. Nestled among these solemn dwellings are a handful of closed-up shops. Even the tavern is shut tight. You hear a soft whimpering.",
        "choices": [
            "Find the source of the whimpering"
        ],
        "responses": [
            {
                "chapter": "same",
                "hook": "intro2"
            }
        ]
    },
    "intro2": {
        "type": "list",
        "name": "intro2",
        "message": "When looking around for the soft whimpering you see a pair of children standing the in the middle of an otherwise lifeless street. They don't look older than 10, maybe even younger. You wonder where their parents could be?",
        "choices": [
            "Approach the children"
        ],
        "responses": [
            {
                "chapter": "same",
                "hook": "intro3"
            }
        ]
    },
    "intro3": {
        "type": "list",
        "name": "intro3",
        "message": "You approach the children. They look scared.",
        "choices": [
            "Introduce yourself"
        ],
        "responses": [
            {
                "chapter": "same",
                "hook": "intro4"
            }
        ]
    },
    "intro4": {
        "type": "list",
        "name": "intro4",
        "message": "You introduce yourself. The oldest looking child seems less scared now that you are here. She introduces herself as Rosavalda, but you may call her Rose. Her little brother, who she introduced as Thornboldt, or Thorn, was weeping while holding a stuffed doll. Both children look almost frighteningly thin, Rose hushed the boy before looking up at you, 'There's a monster in our house!'. She then points to a tall brick row house that has seen better days. Its windows are dark. It has gated portico on the ground floor, and the rusty gate is slightly ajar. The houses on the other side are abandoned, their windows and doors boarded up.",
        "choices": [
            "What does the monster look like?",
            "You know where in the house the monster is?",
            "Does someone else live here with you?",
            "Say nothing"
        ],
        "responses": [
            {
                "chapter": "same",
                "hook": "intro5A"
            },
            {
                "chapter": "same",
                "hook": "intro5B"
            },
            {
                "chapter": "same",
                "hook": "intro5C"
            },
            {
                "chapter": "same",
                "hook": "final"
            }
        ]
    },
    "intro5A": {
        "type": "list",
        "name": "intro5A",
        "message": "'We don't know what the monster looks like, but we heard it's terrible howls' says Rose",
        "choices": [
            "Are you sure you are not just imagining the monster?"
        ],
        "responses": [
            {
                "chapter": "same",
                "hook": "final"
            }
        ]
    },
    "intro5B": {
        "type": "list",
        "name": "intro5B",
        "message": "'Our mommy and daddy keep the monster trapped in the basement.' says Rose",
        "choices": [
            "Are you sure you are not just imagining the monster?"
        ],
        "responses": [
            {
                "chapter": "same",
                "hook": "final"
            }
        ]
    },
    "intro5C": {
        "type": "list",
        "name": "intro5C",
        "message": "'We also have a baby brother, Walter. He is in the third-floor nursery.' says Rose",
        "choices": [
            "Shouldn't you go inside to help care for Walter then? You probably just imagined the monster"
        ],
        "responses": [
            {
                "chapter": "same",
                "hook": "final"
            }
        ]
    },
    "final": {
        "type": "list",
        "name": "root",
        "message": "'We won't go in the house if the monster is still there!' cries Rose",
        "choices": [
            "Don't help the children and leave",
            "Help the children"
        ],
        "checkpoint": 1,
        "responses": [
            {
                "chapter": "chapter1A",
                "hook": "root"
            },
            {
                "chapter": "chapter1B",
                "hook": "root"
            }
        ]
    }
}